sunrise-designs/OpenPolysom/ESP32-C6-heart-idf/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32c6"

# CPU
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_80=y

# Flash size — chip is ESP32-C6FH4 (4MB embedded flash, per the board schematic)
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# FATFS / SD
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255

# Stack sizes
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Serial console / monitor baud rate — also the rate tools/set_time.py uses
# to send the binary time-sync command (see components/time_sync).
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200
CONFIG_ESPTOOLPY_MONITOR_BAUD=115200

# Bluetooth (BLE) — unused; keep the whole BT stack (NimBLE host + controller)
# out of the build.
# CONFIG_BT_ENABLED is not set

# Wi-Fi — compiled in for components/rt_stream (live sample streaming), but the
# radio stays OFF unless streaming has been explicitly enabled for the device
# (RT_STREAM_ENABLED_DEFAULT / tools/set_rt_stream.py), so an ordinary
# unattended night recording keeps the low-power profile this board was built
# for. Wireless rather than the USB link because the AD8232 puts electrodes on
# the patient and a mains-powered tether is a leakage path — see
# ../wiki/state/decisions.md § S12 and ../wiki/knowledge/hardware.md.
CONFIG_ESP_WIFI_ENABLED=y
CONFIG_HTTPD_WS_SUPPORT=y
